## Plan for org_account/iam_identity_center
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_identitystore_group.articles_production_access_vpc_clientvpn will be created
  + resource "aws_identitystore_group" "articles_production_access_vpc_clientvpn" {
      + description       = "Grants members access to the GC Articles Production Client VPN."
      + display_name      = "Articles-Production-Access-VPC-ClientVPN"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.articles_production_admin will be created
  + resource "aws_identitystore_group" "articles_production_admin" {
      + description       = "Grants members administrator access to the GC Articles Production account."
      + display_name      = "Articles-Production-Admin"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.articles_production_read_only will be created
  + resource "aws_identitystore_group" "articles_production_read_only" {
      + description       = "Grants members read-only access to the GC Articles Production account."
      + display_name      = "Articles-Production-ReadOnly"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.articles_staging_access_vpc_clientvpn will be created
  + resource "aws_identitystore_group" "articles_staging_access_vpc_clientvpn" {
      + description       = "Grants members access to the GC Articles Staging Client VPN."
      + display_name      = "Articles-Staging-Access-VPC-ClientVPN"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.articles_staging_admin will be created
  + resource "aws_identitystore_group" "articles_staging_admin" {
      + description       = "Grants members administrator access to the GC Articles Staging account."
      + display_name      = "Articles-Staging-Admin"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.articles_staging_read_only will be created
  + resource "aws_identitystore_group" "articles_staging_read_only" {
      + description       = "Grants members read-only access to the GC Articles Staging account."
      + display_name      = "Articles-Staging-ReadOnly"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Error: Unsupported attribute

  on platform_articles.tf line 87, in resource "aws_ssoadmin_account_assignment" "articles":
  87:   principal_id   = each.value.group.principal_id
    ├────────────────
    │ each.value.group is object with 6 attributes

This object does not have an attribute named "principal_id".

Error: Unsupported attribute

  on platform_articles.tf line 87, in resource "aws_ssoadmin_account_assignment" "articles":
  87:   principal_id   = each.value.group.principal_id
    ├────────────────
    │ each.value.group is object with 6 attributes

This object does not have an attribute named "principal_id".

Error: Unsupported attribute

  on platform_articles.tf line 87, in resource "aws_ssoadmin_account_assignment" "articles":
  87:   principal_id   = each.value.group.principal_id
    ├────────────────
    │ each.value.group is object with 6 attributes

This object does not have an attribute named "principal_id".

Error: Unsupported attribute

  on platform_articles.tf line 87, in resource "aws_ssoadmin_account_assignment" "articles":
  87:   principal_id   = each.value.group.principal_id
    ├────────────────
    │ each.value.group is object with 6 attributes

This object does not have an attribute named "principal_id".

Error: Unsupported attribute

  on platform_articles.tf line 87, in resource "aws_ssoadmin_account_assignment" "articles":
  87:   principal_id   = each.value.group.principal_id
    ├────────────────
    │ each.value.group is object with 6 attributes

This object does not have an attribute named "principal_id".

Error: Unsupported attribute

  on platform_articles.tf line 87, in resource "aws_ssoadmin_account_assignment" "articles":
  87:   principal_id   = each.value.group.principal_id
    ├────────────────
    │ each.value.group is object with 6 attributes

This object does not have an attribute named "principal_id".
time=2024-04-10T12:37:57Z level=error msg=terraform invocation failed in /home/runner/work/cds-aws-lz/cds-aws-lz/terragrunt/org_account/iam_identity_center
time=2024-04-10T12:37:57Z level=error msg=1 error occurred:
	* [/home/runner/work/cds-aws-lz/cds-aws-lz/terragrunt/org_account/iam_identity_center] exit status 1



```

</details>

